---
kind: property
id: P:Autodesk.Revit.UI.DockablePaneState.MinimumWidth
source: html/f22b8f98-87c8-7a8f-45c7-5d8b67034a14.htm
---
# Autodesk.Revit.UI.DockablePaneState.MinimumWidth Property

When %dockPosition% is anything other than floating, the minimum width to use for the pane. Default is 200 pixels.

## Syntax (C#)
```csharp
public int MinimumWidth { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for minimumWidth is not positive.